01  TEST-LAYOUT-FIVE.
        03  A                    PIC S9(4) COMP.
        03  B                    PIC X(8).
        03  C                    PIC S9(3)V99 COMP-3.