      ******************************************************************
      **        GOOGLE CLOUD PLATFORM - COBOL LAYOUT                  **
      ** SOURCE FILE LAYOUT FOR FLASH_STORE_DEPT TABLE                **
      ******************************************************************
       01  FLASH_STORE_DEPT.
           03  FILLER                          PIC X(02).
           03  COUNTRY-CODE                    PIC X(02).
           03  STORE-NBR                       PIC S9(9) COMP.
           03  DEPT-NBR                        PIC S9(9) COMP.
           03  SUMMARY-DATE                    PIC X(10).
           03  SALES-RETAIL-AMT                PIC S9(16)V9(2) COMP-3.
           03  COMP-SALES-AMT                  PIC S9(16)V9(2) COMP-3.
           03  SALES-COST-AMT                  PIC S9(16)V9(2) COMP-3.
           03  COMP-SALESCOST-AMT              PIC S9(16)V9(2) COMP-3.
           03  ITM-ADJ-SALES-AMT               PIC S9(16)V9(2) COMP-3.
           03  ITM-ADJ-COMP-AMT                PIC S9(16)V9(2) COMP-3.
           03  ITM-ADJ-COST-AMT                PIC S9(16)V9(2) COMP-3.
           03  ITM-ADJ-COMP-C-AMT              PIC S9(16)V9(2) COMP-3.
           03  DPT-ADJ-SALES-AMT               PIC S9(16)V9(2) COMP-3.
           03  DPT-ADJ-COMP-AMT                PIC S9(16)V9(2) COMP-3.
           03  CUSTOMER-QTY                    PIC S9(13) COMP-3.
           03  COMP-CUST-QTY                   PIC S9(13) COMP-3.
