    01  TEST-LAYOUT-FIVE.
        03  COL-A                    PIC S9(9) COMP.
        03  COL-B                    PIC S9(4) COMP.
        03  COL-C                    PIC S9(4) COMP.
        03  COL-D                    PIC X(01).
        03  COL-E                    PIC S9(9) COMP.
        03  COL-F                    PIC S9(07)V9(2) COMP-3.
        03  COL-G                    PIC S9(05)V9(4) COMP-3.
        03  COL-H                    PIC S9(9) COMP.
        03  COL-I                    PIC S9(9) COMP.
        03  COL-J                    PIC S9(4) COMP.
        03  COL-K                    PIC S9(16)V9(2) COMP-3.
        03  COL-L                    PIC S9(16)V9(2) COMP-3.
        03  COL-M                    PIC S9(16)V9(2) COMP-3.
