       01 DAILY-ITEMS.
          03 STORE               PIC S9(4) COMP.
          03 ITEM                PIC S9(9) COMP.
          03 WEEK                PIC S9(4) COMP.
          03 PRICE               PIC S9(9)V9(2) COMP-3.
          03 SALES               PIC S9(9)V9(2) COMP-3.
          03 QTY                 PIC S9(9) COMP.
          03 LOCATION            PIC X.
          03 TYPE-CODE           PIC X(08).