       01 TEST-TABLE-THREE.
          03 COL_1      PIC S9(9) COMP.
          03 COL_2      PIC S9(9) COMP.
          03 COL_3      PIC S9(4) COMP.
          03 COL_4      PIC S9(9) COMP.
          03 COL_5      PIC S9(16)V9(2) COMP-3.
          03 COL_6      PIC S9(16)V9(2) COMP-3.
          03 COL_7      PIC S9(9) COMP.
          03 COL_8      PIC S9(16)V9(2) COMP-3.
          03 COL_9      PIC S9(16)V9(2) COMP-3.
          03 COL_10     PIC S9(9) COMP.
          03 COL_11     PIC S9(9) COMP.
          03 COL_12     PIC S9(9) COMP.