       01 STORE-ORDER-SUMRY-SOURCE.
          03 STORE_NBR              PIC S9(9) COMP.
          03 ORDER_DEPT_NBR         PIC S9(9) COMP.
          03 WM_YR_WK               PIC S9(4) COMP.
          03 SS_ORD_CNT             PIC S9(9) COMP.
          03 SS_ORD_RETL_AMT        PIC S9(16)V9(2) COMP-3.
          03 SS_ORD_COST_AMT        PIC S9(16)V9(2) COMP-3.
          03 SS_MN_ORD_CNT          PIC S9(9) COMP.
          03 SS_MN_ORD_RETL_AMT     PIC S9(16)V9(2) COMP-3.
          03 SS_MN_ORD_COST_AMT     PIC S9(16)V9(2) COMP-3.
          03 SS_REPL_ITEM_CNT       PIC S9(9) COMP.
          03 ASM_INITL_ORD_CNT      PIC S9(9) COMP.
          03 ASM_FINAL_ORD_CNT      PIC S9(9) COMP.
          03 ASM_ORD_RETL_AMT       PIC S9(16)V9(2) COMP-3.
          03 ASM_ORD_COST_AMT       PIC S9(16)V9(2) COMP-3.
          03 ASM_MN_ORD_CNT         PIC S9(9) COMP.
          03 ASM_MN_ORD_RETL_AMT    PIC S9(16)V9(2) COMP-3.
          03 ASM_MN_ORD_COST_AMT    PIC S9(16)V9(2) COMP-3.
          03 ASM_REPL_ITEM_CNT      PIC S9(9) COMP.
          03 ASM_MN_DIFF_ORD_QTY    PIC S9(9) COMP.
          03 ASM_MN_DIFF_RETL_AMT   PIC S9(16)V9(2) COMP-3.
          03 ASM_MN_DIFF_COST_AMT   PIC S9(16)V9(2) COMP-3.