        03  STOREKEY.
            05 CODE            PIC X(08).
            05 STORE-NO        PIC S9(03)   COMP-3.
        03  DATE               PIC S9(07)   COMP-3.
        03  DEPT-NO            PIC S9(03)   COMP-3.
        03  QTY-SOLD           PIC S9(9)    COMP-3.
        03  SALE-PRICE         PIC S9(9)V99 COMP-3.