       01 SKU-DLY-POS-REC.
          03 STORE-NBR           PIC S9(4) COMP.
          03 ITEM-NBR            PIC S9(9) COMP.
          03 WM-YR-WK            PIC S9(4) COMP.
          03 REPORT-CODE         PIC S9(4) COMP.
          03 SELL-PRICE          PIC S9(9)V9(2) COMP-3.
          03 SALES               PIC S9(9)V9(2) COMP-3.
          03 QTY                 PIC S9(9) COMP.
          03 SAT-QTY             PIC S9(9) COMP.
          03 SUN-QTY             PIC S9(9) COMP.
          03 MON-QTY             PIC S9(9) COMP.
          03 TUE-QTY             PIC S9(9) COMP.
          03 WED-QTY             PIC S9(9) COMP.
          03 THU-QTY             PIC S9(9) COMP.
          03 FRI-QTY             PIC S9(9) COMP.
          03 DBC-LOCATION        PIC X.
          03 PROCESS-TYPE-FLAG   PIC X.